Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
                    long requested_offset_mv = atol(offset_input_buffer);


                    if (requested_offset_mv >= 0 && requested_offset_mv <= 3300)
                    {
                        current_offset_mv = (unsigned int)requested_offset_mv;

                        precalculated_offset_dac_units = ((long)current_offset_mv * 4095L) / 3300L;
                        uart_send_string("Offset set to: ");
                        uart_send_uint(current_offset_mv);
                        uart_send_string(" mV\r\n> ");
                    }
                    else
                    {
                        uart_send_string("Invalid offset. Enter a value between 0-3300 mV.\r\n> ");
                    }
                } else {
                     uart_send_string("No offset value was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                offset_input_buffer_idx = 0;
                memset(offset_input_buffer, 0, OFFSET_INPUT_BUFFER_SIZE);
            }

            else if (received_char >= '0' && received_char <= '9' && offset_input_buffer_idx < (OFFSET_INPUT_BUFFER_SIZE - 1))
            {
                offset_input_buffer[offset_input_buffer_idx++] = received_char;
            }

            else if ((received_char == '\b' || received_char == 127) && offset_input_buffer_idx > 0)
            {
                offset_input_buffer_idx--;
                uart_send_string(" \b");
            }
        }
        else if (uart_rx_state == PHASE_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (phase_input_buffer_idx > 0)
                {
                    phase_input_buffer[phase_input_buffer_idx] = '\0';
                    int requested_phase = atoi(phase_input_buffer);


                    if (requested_phase >= 0 && requested_phase < 300)
                    {
                        current_phase_offset_samples = (unsigned int)requested_phase;
                        uart_send_string("Phase set to: ");
                        uart_send_uint(current_phase_offset_samples);
                        uart_send_string(" samples\r\n> ");
                    }
                    else
                    {
                        uart_send_string("Invalid phase. Enter a value between 0-299 samples.\r\n> ");
                    }
                } else {
                     uart_send_string("No phase value was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                phase_input_buffer_idx = 0;
                memset(phase_input_buffer, 0, PHASE_INPUT_BUFFER_SIZE);
            }

            else if (received_char >= '0' && received_char <= '9' && phase_input_buffer_idx < (PHASE_INPUT_BUFFER_SIZE - 1))
            {
                phase_input_buffer[phase_input_buffer_idx++] = received_char;
            }

            else if ((received_char == '\b' || received_char == 127) && phase_input_buffer_idx > 0)
            {
                phase_input_buffer_idx--;
                uart_send_string(" \b");
            }
        }
        else
        {
            if (received_char == 'F' || received_char == 'f')
            {
                uart_rx_state = FREQUENCY_INPUT_MODE;
                freq_input_buffer_idx = 0;
                memset(freq_input_buffer, 0, FREQ_INPUT_BUFFER_SIZE);
                uart_send_string("\r\nEnter Frequency (1-10000Hz), then Enter: ");
            }
            else if (received_char == 'A' || received_char == 'a')
            {
                uart_rx_state = AMPLITUDE_INPUT_MODE;
                amplitude_input_buffer_idx = 0;
                memset(amplitude_input_buffer, 0, AMPLITUDE_INPUT_BUFFER_SIZE);
                uart_send_string("\r\nEnter Amplitude (0-100%), then Enter: ");
            }
            else if (received_char == 'O' || received_char == 'o')
            {
                uart_rx_state = OFFSET_INPUT_MODE;
                offset_input_buffer_idx = 0;
                memset(offset_input_buffer, 0, OFFSET_INPUT_BUFFER_SIZE);
                uart_send_string("\r\nEnter Offset (0-3300mV), then Enter: ");
            }
            else if (received_char == 'H' || received_char == 'h')
            {
                uart_rx_state = PHASE_INPUT_MODE;
                phase_input_buffer_idx = 0;
                memset(phase_input_buffer, 0, PHASE_INPUT_BUFFER_SIZE);
                uart_send_string("\r\nEnter Phase (0-299 samples), then Enter: ");
            }
            else if (received_char == '#')
            {

                for(j=0;j<3;j++)
                {
                   ADC_char[j][2] = j+48;

                   ADC_char[j][4] = ((ADC_Result[j]/1000)%10)+48;
                   ADC_char[j][6] = ((ADC_Result[j]/100)%10)+48;
                   ADC_char[j][5] = ((ADC_Result[j]/10)%10)+48;
                   ADC_char[j][7] = (ADC_Result[j]%10)+48;
                }

                for(j=0;j<3;j++) {
                    for(i=0;i<12;i++) {
                        while(!(UCA1IFG&UCTXIFG));
                        UCA1TXBUF = ADC_char[j][i];
                    }
                }
                uart_send_string("\r\n> ");
            }

            // Waveform assignment commands for the selected assignment slot.
            else if(received_char == 's') {
                waveform_slots[current_assignment_slot_index] = sine_wave;
                uart_send_string("\r\nSine assigned to Slot "); uart_send_uint(current_assignment_slot_index); uart_send_string(".\r\n> ");
            }
            else if(received_char == 't') {
                waveform_slots[current_assignment_slot_index] = triangle_wave;
                uart_send_string("\r\nTriangle assigned to Slot "); uart_send_uint(current_assignment_slot_index); uart_send_string(".\r\n> ");
            }
            else if(received_char == 'r') {
                waveform_slots[current_assignment_slot_index] = ramp_wave;
                uart_send_string("\r\nRamp assigned to Slot "); uart_send_uint(current_assignment_slot_index); uart_send_string(".\r\n> ");
            }
            else if(received_char == 'p') {
                waveform_slots[current_assignment_slot_index] = square_wave;
                uart_send_string("\r\nSquare assigned to Slot "); uart_send_uint(current_assignment_slot_index); uart_send_string(".\r\n> ");
            }
            else if(received_char == 'c') {
                waveform_slots[current_assignment_slot_index] = pulse_train_wave;
                uart_send_string("\r\nPulse train assigned to Slot "); uart_send_uint(current_assignment_slot_index); uart_send_string(".\r\n> ");
            }

            // Assignment-slot selection commands.
            else if(received_char == 'X' || received_char == 'x') {
                current_assignment_slot_index = 0;
                uart_send_string("\r\nSlot 0 for assignment.\r\n> ");
            }
            else if(received_char == 'Y' || received_char == 'y') {
                current_assignment_slot_index = 1;
                uart_send_string("\r\nSlot 1 for assignment.\r\n> ");
            }
            else if(received_char == 'Z' || received_char == 'z') {
                current_assignment_slot_index = 2;
                uart_send_string("\r\nSlot 2 for assignment.\r\n> ");
            }

            // Output-slot selection commands.
            else if(received_char == 'L' || received_char == 'l') {
                current_output_slot_index = 0;
                uart_send_string("\r\nSlot 0 for DAC output.\r\n> ");
            }
            else if(received_char == 'M' || received_char == 'm') {
                current_output_slot_index = 1;
                uart_send_string("\r\nSlot 1 for DAC output.\r\n> ");
            }
            else if(received_char == 'N' || received_char == 'n') {
                current_output_slot_index = 2;
                uart_send_string("\r\nSlot 2 for DAC output.\r\n> ");
            }
            else if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n> ");
            }
            else
            {
                uart_send_string("\r\nUnknown command.\r\n> ");
            }
        }
      break;
    case USCI_UART_UCTXIFG: break;
    case USCI_UART_UCSTTIFG: break;
    case USCI_UART_UCTXCPTIFG: break;
    default: break;
  }
}




#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// Timer B2 CCR0 ISR: waveform sample generation and DAC update.
#pragma vector = TIMER2_B0_VECTOR
__interrupt void Timer2_B0_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(TIMER2_B0_VECTOR))) Timer2_B0_ISR (void)
#else
#error Compiler not supported!
#endif
{


    // Schedule the next update event by incrementing CCR0.
    TB2CCR0 += timer_b0_ccr0_increment;


    // Advance waveform sample index with wrap-around at 300 samples.
    current_waveform_index++;
    if(current_waveform_index >= 300)
        current_waveform_index = 0;


