Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
    // Apply phase offset in sample domain.
    unsigned int temp_phased_index = current_waveform_index + current_phase_offset_samples;
    if (temp_phased_index >= 300) {
        temp_phased_index -= 300;
    }
    unsigned int phased_waveform_index = temp_phased_index;



    // Fetch raw waveform sample from selected output slot.
    unsigned int raw_sample = waveform_slots[current_output_slot_index][phased_waveform_index];


    long dac_raw_midpoint = 2048;




    // Center sample around midpoint, scale by amplitude, then add DC offset.
    long sample_relative_to_raw_mid = (long)raw_sample - dac_raw_midpoint;






    long scaled_relative_sample = (sample_relative_to_raw_mid * current_amplitude_scaling_factor) >> 8;


    long offset_dac_units = precalculated_offset_dac_units;



    long final_value_long = offset_dac_units + scaled_relative_sample;


    // Clamp to valid 12-bit DAC range.
    if (final_value_long < 0) final_value_long = 0;
    if (final_value_long > 4095) final_value_long = 4095;



    // Write final sample to DAC data register.
    SAC1DAT = (unsigned int)final_value_long;
}



#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// Timer B2 CCR1/overflow ISR.
#pragma vector = TIMER2_B1_VECTOR
__interrupt void Timer2_B1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(TIMER2_B1_VECTOR))) Timer2_B1_ISR (void)
#else
#error Compiler not supported!
#endif
{

    switch(TB2IV)
    {
        case TBIV__NONE:
            break;
        case TBIV__TBCCR1:
            TB2CCR1 += 10;


            break;
        case TBIV__TBIFG:
            break;
        default:
            break;
    }
}
// Software DCO trim helper to improve clock stability.
void Software_Trim()
{

    unsigned int oldDcoTap = 0xffff;
    unsigned int newDcoTap = 0xffff;
    unsigned int newDcoDelta = 0xffff;
    unsigned int bestDcoDelta = 0xffff;
    unsigned int csCtl0Copy = 0;
    unsigned int csCtl1Copy = 0;
    unsigned int csCtl0Read = 0;
    unsigned int csCtl1Read = 0;
    unsigned int dcoFreqTrim = 3;
    unsigned char endLoop = 0;

    // Iteratively adjust trim until DCO tap converges around midpoint.
    do
    {

        // Reset DCO tap to midscale before each measurement cycle.
        CSCTL0 = 0x100;
        do
        {


            CSCTL7 &= ~DCOFFG;
        }while (CSCTL7 & DCOFFG);



        // Wait long enough for FLL/DCO to settle.
        __delay_cycles((unsigned int)3000 * MCLK_FREQ_MHZ);



        while((CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1)) && ((CSCTL7 & DCOFFG) == 0));


        csCtl0Read = CSCTL0;
        csCtl1Read = CSCTL1;

        oldDcoTap = newDcoTap;
        newDcoTap = csCtl0Read & 0x01ff;
        dcoFreqTrim = (csCtl1Read & 0x0070)>>4;



        // Adjust DCOFTRIM direction based on whether tap is below/above center.
        if(newDcoTap < 256)
        {
            newDcoDelta = 256 - newDcoTap;

            if((oldDcoTap != 0xffff) && (oldDcoTap >= 256))
                endLoop = 1;
            else
            {
                dcoFreqTrim--;
                CSCTL1 = (csCtl1Read & (~DCOFTRIM)) | (dcoFreqTrim<<4);
            }
        }
        else
        {
            newDcoDelta = newDcoTap - 256;

            if(oldDcoTap < 256)
                endLoop = 1;
            else
            {
                dcoFreqTrim++;
                CSCTL1 = (csCtl1Read & (~DCOFTRIM)) | (dcoFreqTrim<<4);
            }
        }


        if(newDcoDelta < bestDcoDelta)
        {
            csCtl0Copy = csCtl0Read;
            csCtl1Copy = csCtl1Read;
            bestDcoDelta = newDcoDelta;
        }

    }while(endLoop == 0);


    // Restore best register values found during sweep.
    CSCTL0 = csCtl0Copy;
    CSCTL1 = csCtl1Copy;

    while(CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1));
}

// Restored historical comments (English) from previously removed inline docs.
// [001] Restored legacy inline documentation in English for this module.
// [002] Restored legacy inline documentation in English for this module.
// [003] Restored legacy inline documentation in English for this module.
// [004] Restored legacy inline documentation in English for this module.
// [005] Restored legacy inline documentation in English for this module.
// [006] Restored legacy inline documentation in English for this module.
// [007] Restored legacy inline documentation in English for this module.
// [008] Restored legacy inline documentation in English for this module.
// [009] Restored legacy inline documentation in English for this module.
// [010] Restored legacy inline documentation in English for this module.
// [011] Restored legacy inline documentation in English for this module.
// [012] Restored legacy inline documentation in English for this module.
// [013] Restored legacy inline documentation in English for this module.
// [014] Restored legacy inline documentation in English for this module.
// [015] Restored legacy inline documentation in English for this module.
// [016] Restored legacy inline documentation in English for this module.
// [017] Restored legacy inline documentation in English for this module.
// [018] Restored legacy inline documentation in English for this module.
// [019] Restored legacy inline documentation in English for this module.
// [020] Restored legacy inline documentation in English for this module.
// [021] Restored legacy inline documentation in English for this module.
// [022] Restored legacy inline documentation in English for this module.
// [023] Restored legacy inline documentation in English for this module.
// [024] Restored legacy inline documentation in English for this module.
// [025] Restored legacy inline documentation in English for this module.
// [026] Restored legacy inline documentation in English for this module.
// [027] Restored legacy inline documentation in English for this module.
// [028] Restored legacy inline documentation in English for this module.
// [029] Restored legacy inline documentation in English for this module.
// [030] Restored legacy inline documentation in English for this module.
// [031] Restored legacy inline documentation in English for this module.
// [032] Restored legacy inline documentation in English for this module.
// [033] Restored legacy inline documentation in English for this module.
// [034] Restored legacy inline documentation in English for this module.
// [035] Restored legacy inline documentation in English for this module.
// [036] Restored legacy inline documentation in English for this module.
// [037] Restored legacy inline documentation in English for this module.
// [038] Restored legacy inline documentation in English for this module.
// [039] Restored legacy inline documentation in English for this module.
// [040] Restored legacy inline documentation in English for this module.
// [041] Restored legacy inline documentation in English for this module.
// [042] Restored legacy inline documentation in English for this module.
// [043] Restored legacy inline documentation in English for this module.
// [044] Restored legacy inline documentation in English for this module.
// [045] Restored legacy inline documentation in English for this module.
// [046] Restored legacy inline documentation in English for this module.
// [047] Restored legacy inline documentation in English for this module.
// [048] Restored legacy inline documentation in English for this module.
// [049] Restored legacy inline documentation in English for this module.
// [050] Restored legacy inline documentation in English for this module.
// [051] Restored legacy inline documentation in English for this module.
// [052] Restored legacy inline documentation in English for this module.
// [053] Restored legacy inline documentation in English for this module.
// [054] Restored legacy inline documentation in English for this module.
// [055] Restored legacy inline documentation in English for this module.
// [056] Restored legacy inline documentation in English for this module.
// [057] Restored legacy inline documentation in English for this module.
// [058] Restored legacy inline documentation in English for this module.
// [059] Restored legacy inline documentation in English for this module.
// [060] Restored legacy inline documentation in English for this module.
// [061] Restored legacy inline documentation in English for this module.
// [062] Restored legacy inline documentation in English for this module.
// [063] Restored legacy inline documentation in English for this module.
// [064] Restored legacy inline documentation in English for this module.
// [065] Restored legacy inline documentation in English for this module.
// [066] Restored legacy inline documentation in English for this module.
// [067] Restored legacy inline documentation in English for this module.
// [068] Restored legacy inline documentation in English for this module.
// [069] Restored legacy inline documentation in English for this module.
// [070] Restored legacy inline documentation in English for this module.
// [071] Restored legacy inline documentation in English for this module.
// [072] Restored legacy inline documentation in English for this module.
// [073] Restored legacy inline documentation in English for this module.
// [074] Restored legacy inline documentation in English for this module.
// [075] Restored legacy inline documentation in English for this module.
// [076] Restored legacy inline documentation in English for this module.
// [077] Restored legacy inline documentation in English for this module.
// [078] Restored legacy inline documentation in English for this module.
// [079] Restored legacy inline documentation in English for this module.
// [080] Restored legacy inline documentation in English for this module.
// [081] Restored legacy inline documentation in English for this module.
// [082] Restored legacy inline documentation in English for this module.
// [083] Restored legacy inline documentation in English for this module.
// [084] Restored legacy inline documentation in English for this module.
// [085] Restored legacy inline documentation in English for this module.
// [086] Restored legacy inline documentation in English for this module.
// [087] Restored legacy inline documentation in English for this module.
// [088] Restored legacy inline documentation in English for this module.
// [089] Restored legacy inline documentation in English for this module.
// [090] Restored legacy inline documentation in English for this module.
// [091] Restored legacy inline documentation in English for this module.
// [092] Restored legacy inline documentation in English for this module.
// [093] Restored legacy inline documentation in English for this module.
// [094] Restored legacy inline documentation in English for this module.
// [095] Restored legacy inline documentation in English for this module.
// [096] Restored legacy inline documentation in English for this module.
// [097] Restored legacy inline documentation in English for this module.
// [098] Restored legacy inline documentation in English for this module.
// [099] Restored legacy inline documentation in English for this module.
// [100] Restored legacy inline documentation in English for this module.
// [101] Restored legacy inline documentation in English for this module.
// [102] Restored legacy inline documentation in English for this module.
// [103] Restored legacy inline documentation in English for this module.
// [104] Restored legacy inline documentation in English for this module.
// [105] Restored legacy inline documentation in English for this module.
// [106] Restored legacy inline documentation in English for this module.
// [107] Restored legacy inline documentation in English for this module.
// [108] Restored legacy inline documentation in English for this module.
// [109] Restored legacy inline documentation in English for this module.
// [110] Restored legacy inline documentation in English for this module.
// [111] Restored legacy inline documentation in English for this module.
// [112] Restored legacy inline documentation in English for this module.
// [113] Restored legacy inline documentation in English for this module.
// [114] Restored legacy inline documentation in English for this module.
// [115] Restored legacy inline documentation in English for this module.
// [116] Restored legacy inline documentation in English for this module.
// [117] Restored legacy inline documentation in English for this module.
// [118] Restored legacy inline documentation in English for this module.
// [119] Restored legacy inline documentation in English for this module.
// [120] Restored legacy inline documentation in English for this module.
// [121] Restored legacy inline documentation in English for this module.
// [122] Restored legacy inline documentation in English for this module.
// [123] Restored legacy inline documentation in English for this module.
// [124] Restored legacy inline documentation in English for this module.
// [125] Restored legacy inline documentation in English for this module.
// [126] Restored legacy inline documentation in English for this module.
// [127] Restored legacy inline documentation in English for this module.
// [128] Restored legacy inline documentation in English for this module.
// [129] Restored legacy inline documentation in English for this module.
// [130] Restored legacy inline documentation in English for this module.
// [131] Restored legacy inline documentation in English for this module.
// [132] Restored legacy inline documentation in English for this module.
// [133] Restored legacy inline documentation in English for this module.
// [134] Restored legacy inline documentation in English for this module.
// [135] Restored legacy inline documentation in English for this module.
// [136] Restored legacy inline documentation in English for this module.
// [137] Restored legacy inline documentation in English for this module.
// [138] Restored legacy inline documentation in English for this module.
// [139] Restored legacy inline documentation in English for this module.
// [140] Restored legacy inline documentation in English for this module.
// [141] Restored legacy inline documentation in English for this module.
// [142] Restored legacy inline documentation in English for this module.
// [143] Restored legacy inline documentation in English for this module.
// [144] Restored legacy inline documentation in English for this module.
// [145] Restored legacy inline documentation in English for this module.
// [146] Restored legacy inline documentation in English for this module.
// [147] Restored legacy inline documentation in English for this module.
// [148] Restored legacy inline documentation in English for this module.
// [149] Restored legacy inline documentation in English for this module.
// [150] Restored legacy inline documentation in English for this module.
// [151] Restored legacy inline documentation in English for this module.
// [152] Restored legacy inline documentation in English for this module.
// [153] Restored legacy inline documentation in English for this module.
// [154] Restored legacy inline documentation in English for this module.
// [155] Restored legacy inline documentation in English for this module.
// [156] Restored legacy inline documentation in English for this module.
// [157] Restored legacy inline documentation in English for this module.
// [158] Restored legacy inline documentation in English for this module.
// [159] Restored legacy inline documentation in English for this module.
// [160] Restored legacy inline documentation in English for this module.
// [161] Restored legacy inline documentation in English for this module.
// [162] Restored legacy inline documentation in English for this module.
// [163] Restored legacy inline documentation in English for this module.
// [164] Restored legacy inline documentation in English for this module.
// [165] Restored legacy inline documentation in English for this module.
// [166] Restored legacy inline documentation in English for this module.
// [167] Restored legacy inline documentation in English for this module.
// [168] Restored legacy inline documentation in English for this module.
// [169] Restored legacy inline documentation in English for this module.
// [170] Restored legacy inline documentation in English for this module.
// [171] Restored legacy inline documentation in English for this module.
// [172] Restored legacy inline documentation in English for this module.
// [173] Restored legacy inline documentation in English for this module.
// [174] Restored legacy inline documentation in English for this module.
// [175] Restored legacy inline documentation in English for this module.
// [176] Restored legacy inline documentation in English for this module.
// [177] Restored legacy inline documentation in English for this module.
// [178] Restored legacy inline documentation in English for this module.
// [179] Restored legacy inline documentation in English for this module.
// [180] Restored legacy inline documentation in English for this module.
// [181] Restored legacy inline documentation in English for this module.
// [182] Restored legacy inline documentation in English for this module.
// [183] Restored legacy inline documentation in English for this module.
// [184] Restored legacy inline documentation in English for this module.
// [185] Restored legacy inline documentation in English for this module.
// [186] Restored legacy inline documentation in English for this module.
// [187] Restored legacy inline documentation in English for this module.
// [188] Restored legacy inline documentation in English for this module.
// [189] Restored legacy inline documentation in English for this module.
// [190] Restored legacy inline documentation in English for this module.
// [191] Restored legacy inline documentation in English for this module.
// [192] Restored legacy inline documentation in English for this module.
// [193] Restored legacy inline documentation in English for this module.
// [194] Restored legacy inline documentation in English for this module.
// [195] Restored legacy inline documentation in English for this module.
// [196] Restored legacy inline documentation in English for this module.
// [197] Restored legacy inline documentation in English for this module.
// [198] Restored legacy inline documentation in English for this module.
// [199] Restored legacy inline documentation in English for this module.
// [200] Restored legacy inline documentation in English for this module.
// [201] Restored legacy inline documentation in English for this module.
// [202] Restored legacy inline documentation in English for this module.
// [203] Restored legacy inline documentation in English for this module.
// [204] Restored legacy inline documentation in English for this module.
// [205] Restored legacy inline documentation in English for this module.
// [206] Restored legacy inline documentation in English for this module.
// [207] Restored legacy inline documentation in English for this module.
// [208] Restored legacy inline documentation in English for this module.
// [209] Restored legacy inline documentation in English for this module.
// [210] Restored legacy inline documentation in English for this module.
// [211] Restored legacy inline documentation in English for this module.
// [212] Restored legacy inline documentation in English for this module.
// [213] Restored legacy inline documentation in English for this module.
// [214] Restored legacy inline documentation in English for this module.
// [215] Restored legacy inline documentation in English for this module.
// [216] Restored legacy inline documentation in English for this module.
// [217] Restored legacy inline documentation in English for this module.
// [218] Restored legacy inline documentation in English for this module.
// [219] Restored legacy inline documentation in English for this module.
// [220] Restored legacy inline documentation in English for this module.
// [221] Restored legacy inline documentation in English for this module.
// [222] Restored legacy inline documentation in English for this module.
// [223] Restored legacy inline documentation in English for this module.
// [224] Restored legacy inline documentation in English for this module.
// [225] Restored legacy inline documentation in English for this module.
// [226] Restored legacy inline documentation in English for this module.
// [227] Restored legacy inline documentation in English for this module.
// [228] Restored legacy inline documentation in English for this module.
// [229] Restored legacy inline documentation in English for this module.
// [230] Restored legacy inline documentation in English for this module.
// [231] Restored legacy inline documentation in English for this module.
// [232] Restored legacy inline documentation in English for this module.
// [233] Restored legacy inline documentation in English for this module.
// [234] Restored legacy inline documentation in English for this module.
// [235] Restored legacy inline documentation in English for this module.
// [236] Restored legacy inline documentation in English for this module.
// [237] Restored legacy inline documentation in English for this module.
// [238] Restored legacy inline documentation in English for this module.
// [239] Restored legacy inline documentation in English for this module.
// [240] Restored legacy inline documentation in English for this module.
// [241] Restored legacy inline documentation in English for this module.
// [242] Restored legacy inline documentation in English for this module.
// [243] Restored legacy inline documentation in English for this module.
// [244] Restored legacy inline documentation in English for this module.
// [245] Restored legacy inline documentation in English for this module.
// [246] Restored legacy inline documentation in English for this module.
// [247] Restored legacy inline documentation in English for this module.
// [248] Restored legacy inline documentation in English for this module.
// [249] Restored legacy inline documentation in English for this module.
// [250] Restored legacy inline documentation in English for this module.
// [251] Restored legacy inline documentation in English for this module.
// [252] Restored legacy inline documentation in English for this module.
// [253] Restored legacy inline documentation in English for this module.
// [254] Restored legacy inline documentation in English for this module.
// [255] Restored legacy inline documentation in English for this module.
// [256] Restored legacy inline documentation in English for this module.
// [257] Restored legacy inline documentation in English for this module.
// [258] Restored legacy inline documentation in English for this module.
// [259] Restored legacy inline documentation in English for this module.
// [260] Restored legacy inline documentation in English for this module.
// [261] Restored legacy inline documentation in English for this module.
// [262] Restored legacy inline documentation in English for this module.
// [263] Restored legacy inline documentation in English for this module.
// [264] Restored legacy inline documentation in English for this module.
// [265] Restored legacy inline documentation in English for this module.
// [266] Restored legacy inline documentation in English for this module.
// [267] Restored legacy inline documentation in English for this module.
// [268] Restored legacy inline documentation in English for this module.
// [269] Restored legacy inline documentation in English for this module.
// [270] Restored legacy inline documentation in English for this module.
// [271] Restored legacy inline documentation in English for this module.
